dna001/qemu/hw/stm32f2xx_uart.c
/*
 * STM32 Microcontroller UART module
 *
 * Copyright (C) 2010 Andre Beckus
 *
 * Source code based on pl011.c
 * Implementation based on ST Microelectronics "RM0008 Reference Manual Rev 10"
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as
 * published by the Free Software Foundation; either version 2 of
 * the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#include "sysbus.h"
#include "stm32f2xx.h"



/* DEFINITIONS*/

/* See the README file for details on these settings. */
//#define DEBUG_STM32_UART
//#define STM32_UART_NO_BAUD_DELAY
//#define STM32_UART_ENABLE_OVERRUN

#ifdef DEBUG_STM32_UART
#define DPRINTF(fmt, ...)                                       \
    do { printf("STM32_UART: " fmt , ## __VA_ARGS__); } while (0)
#else
#define DPRINTF(fmt, ...)
#endif

#define USART_SR_OFFSET 0x00
#define USART_SR_TXE_BIT 7
#define USART_SR_TC_BIT 6
#define USART_SR_RXNE_BIT 5
#define USART_SR_ORE_BIT 3

#define USART_DR_OFFSET 0x04

#define USART_BRR_OFFSET 0x08

#define USART_CR1_OFFSET 0x0c
#define USART_CR1_UE_BIT 13
#define USART_CR1_M_BIT 12
#define USART_CR1_PCE_BIT 10
#define USART_CR1_PS_BIT 9
#define USART_CR1_TXEIE_BIT 7
#define USART_CR1_TCIE_BIT 6
#define USART_CR1_RXNEIE_BIT 5
#define USART_CR1_TE_BIT 3
#define USART_CR1_RE_BIT 2

#define USART_CR2_OFFSET 0x10
#define USART_CR2_STOP_START 12
#define USART_CR2_STOP_MASK 0x00003000

#define USART_CR3_OFFSET 0x14
#define USART_CR3_CTSE_BIT 9
#define USART_CR3_RTSE_BIT 8

#define USART_GTPR_OFFSET 0x18


struct Stm32Uart {
    /* Inherited */
    SysBusDevice busdev;

    /* Properties */
    stm32_periph_t periph;
    void *stm32_rcc_prop;
    void *stm32_gpio_prop;
    void *stm32_afio_prop;

    /* Private */
    MemoryRegion iomem;

    Stm32Rcc *stm32_rcc;
    Stm32Gpio **stm32_gpio;
    Stm32Afio *stm32_afio;

    int uart_index;

    uint32_t bits_per_sec;
    int64_t ns_per_char;

    /* Register Values */
    uint32_t
        USART_RDR,
        USART_TDR,
        USART_BRR,
        USART_CR1,
        USART_CR2,
        USART_CR3;

    /* Register Field Values */
    uint32_t
        USART_SR_TXE,
        USART_SR_TC,
        USART_SR_RXNE,
        USART_SR_ORE,
        USART_CR1_UE,
        USART_CR1_TXEIE,
        USART_CR1_TCIE,
        USART_CR1_RXNEIE,
        USART_CR1_TE,
        USART_CR1_RE;

    bool sr_read_since_ore_set;

    /* Indicates whether the USART is currently receiving a byte. */
    bool receiving;

    /* Timers used to simulate a delay corresponding to the baud rate. */
    struct QEMUTimer *rx_timer;
    struct QEMUTimer *tx_timer;

    CharDriverState *chr;

    /* Stores the USART pin mapping used by the board.  This is used to check
     * the AFIO's USARTx_REMAP register to make sure the software has set
     * the correct mapping.
     */
    uint32_t afio_board_map;

    qemu_irq irq;
    int curr_irq_level;
};






/* HELPER FUNCTIONS */

/* Update the baud rate based on the USART's peripheral clock frequency. */
static void stm32_uart_baud_update(Stm32Uart *s)
{
    uint32_t clk_freq = stm32f2xx_rcc_get_periph_freq(s->stm32_rcc, s->periph);
    uint64_t ns_per_bit;

    if((s->USART_BRR == 0) || (clk_freq == 0)) {
        s->bits_per_sec = 0;
    } else {
        s->bits_per_sec = clk_freq / s->USART_BRR;
        ns_per_bit = 1000000000LL / s->bits_per_sec;

        /* We assume 10 bits per character.  This may not be exactly
         * accurate depending on settings, but it should be good enough. */
        s->ns_per_char = ns_per_bit * 10;
    }

#ifdef DEBUG_STM32_UART
    DPRINTF("%s clock is set to %lu Hz.\n",
                stm32f2xx_periph_name(s->periph),
                (unsigned long)clk_freq);
    DPRINTF("%s BRR set to %lu.\n",
                stm32f2xx_periph_name(s->periph),
                (unsigned long)s->USART_BRR);
    DPRINTF("%s Baud is set to %lu bits per sec.\n",
                stm32f2xx_periph_name(s->periph),
                (unsigned long)s->bits_per_sec);
#endif
}

/* Handle a change in the peripheral clock. */
static void stm32_uart_clk_irq_handler(void *opaque, int n, int level)
{
    Stm32Uart *s = (Stm32Uart *)opaque;

    assert(n == 0);

    /* Only update the BAUD rate if the IRQ is being set. */
    if(level) {
        stm32_uart_baud_update(s);
    }
}

/* Routine which updates the USART's IRQ.  This should be called whenever
 * an interrupt-related flag is updated.
 */
static void stm32_uart_update_irq(Stm32Uart *s) {
    /* Note that we are not checking the ORE flag, but we should be. */
    int new_irq_level =
       (s->USART_CR1_TCIE & s->USART_SR_TC) |
       (s->USART_CR1_TXEIE & s->USART_SR_TXE) |
       (s->USART_CR1_RXNEIE &
               (s->USART_SR_ORE | s->USART_SR_RXNE));

    /* Only trigger an interrupt if the IRQ level changes.  We probably could
     * set the level regardless, but we will just check for good measure.
     */
    if(new_irq_level ^ s->curr_irq_level) {
        qemu_set_irq(s->irq, new_irq_level);
        s->curr_irq_level = new_irq_level;
    }
}


static void stm32_uart_start_tx(Stm32Uart *s, uint32_t value);

/* Routine to be called when a transmit is complete. */
static void stm32_uart_tx_complete(Stm32Uart *s)
{
    if(s->USART_SR_TXE == 1) {
        /* If the buffer is empty, there is nothing waiting to be transmitted.
         * Mark the transmit complete. */
        s->USART_SR_TC = 1;
        stm32_uart_update_irq(s);
    } else {
        /* Otherwise, mark the transmit buffer as empty and
         * start transmitting the value stored there.
         */
        s->USART_SR_TXE = 1;
        stm32_uart_update_irq(s);
        stm32_uart_start_tx(s, s->USART_TDR);
    }
}

