dna001/qemu/hw/stm32f2xx_uart.c
/* Start transmitting a character. */
static void stm32_uart_start_tx(Stm32Uart *s, uint32_t value)
{
    uint64_t curr_time = qemu_get_clock_ns(vm_clock);
    uint8_t ch = value; //This will truncate the ninth bit

    /* Reset the Transmission Complete flag to indicate a transmit is in
     * progress.
     */
    s->USART_SR_TC = 0;

    /* Write the character out. */
    if (s->chr) {
        qemu_chr_fe_write(s->chr, &ch, 1);
    }
#ifdef STM32_UART_NO_BAUD_DELAY
    /* If BAUD delays are not being simulated, then immediately mark the
     * transmission as complete.
     */
    curr_time = curr_time; //Avoid "variable unused" compiler error
    stm32_uart_tx_complete(s);
#else
    /* Otherwise, start the transmit delay timer. */
    qemu_mod_timer(s->tx_timer,  curr_time + s->ns_per_char);
#endif
}

/* Checks the USART transmit pin's GPIO settings.  If the GPIO is not configured
 * properly, a hardware error is triggered.
 */
static void stm32_uart_check_tx_pin(Stm32Uart *s)
{
    int tx_periph, tx_pin;
    int config;
    
    return;
#if 0
    switch(s->periph) {
        case STM32_UART1:
            switch(stm32f2xx_afio_get_periph_map(s->stm32_afio, s->periph)) {
                case STM32_USART1_NO_REMAP:
                    tx_periph = STM32_GPIOA;
                    tx_pin = 9;
                    break;
                case STM32_USART1_REMAP:
                    tx_periph = STM32_GPIOB;
                    tx_pin = 6;
                    break;
                default:
                    assert(false);
                    break;
            }
            break;
        case STM32_UART2:
            switch(stm32f2xx_afio_get_periph_map(s->stm32_afio, s->periph)) {
                case STM32_USART2_NO_REMAP:
                    tx_periph = STM32_GPIOA;
                    tx_pin = 2;
                    break;
                case STM32_USART2_REMAP:
                    tx_periph = STM32_GPIOD;
                    tx_pin = 5;
                    break;
                default:
                    assert(false);
                    break;
            }
            break;
        case STM32_UART3:
            switch(stm32f2xx_afio_get_periph_map(s->stm32_afio, s->periph)) {
                case STM32_USART3_NO_REMAP:
                    tx_periph = STM32_GPIOB;
                    tx_pin = 10;
                    break;
                case STM32_USART3_PARTIAL_REMAP:
                    tx_periph = STM32_GPIOC;
                    tx_pin = 10;
                    break;
                case STM32_USART3_FULL_REMAP:
                    tx_periph = STM32_GPIOD;
                    tx_pin = 8;
                    break;
                default:
                    assert(false);
                    break;
            }
            break;
        default:
            assert(false);
            break;
    }

    Stm32Gpio *gpio_dev = s->stm32_gpio[STM32_GPIO_INDEX_FROM_PERIPH(tx_periph)];

    if(stm32f2xx_gpio_get_mode_bits(gpio_dev, tx_pin) == STM32_GPIO_MODE_IN) {
        hw_error("UART TX pin needs to be configured as output");
    }

    config = stm32f2xx_gpio_get_config_bits(gpio_dev, tx_pin);
    if((config != STM32_GPIO_OUT_ALT_PUSHPULL) &&
            (config != STM32_GPIO_OUT_ALT_OPEN)) {
        hw_error("UART TX pin needs to be configured as "
                 "alternate function output");
    }
#endif
}





/* TIMER HANDLERS */
/* Once the receive delay is finished, indicate the USART is finished receiving.
 * This will allow it to receive the next character.  The current character was
 * already received before starting the delay.
 */
static void stm32_uart_rx_timer_expire(void *opaque) {
    Stm32Uart *s = (Stm32Uart *)opaque;

    s->receiving = false;
}

/* When the transmit delay is complete, mark the transmit as complete
 * (the character was already sent before starting the delay). */
static void stm32_uart_tx_timer_expire(void *opaque) {
    Stm32Uart *s = (Stm32Uart *)opaque;

    stm32_uart_tx_complete(s);
}





/* CHAR DEVICE HANDLERS */

static int stm32_uart_can_receive(void *opaque)
{
    Stm32Uart *s = (Stm32Uart *)opaque;

    if(s->USART_CR1_UE && s->USART_CR1_RE) {
        /* The USART can only receive if it is enabled. */
        if(s->receiving) {
            /* If the USART is already receiving, then it cannot receive another
             * character yet.
             */
            return 0;
        } else {
#ifdef STM32_UART_ENABLE_OVERRUN
            /* If overrun is enabled, then always allow the next character to be
             * received even if the buffer already has a value.  This is how
             * real hardware behaves.*/
            return 1;
#else
            /* Otherwise, do not allow the next character to be received until
             * software has read the previous one.
             */
            if(s->USART_SR_RXNE) {
                return 0;
            } else {
                return 1;
            }
#endif
        }
    } else {
        /* Always allow a character to be received if the module is disabled.
         * However, the character will just be ignored (just like on real
         * hardware). */
        return 1;
    }
}

static void stm32_uart_event(void *opaque, int event)
{
    /* Do nothing */
}

static void stm32_uart_receive(void *opaque, const uint8_t *buf, int size)
{
    Stm32Uart *s = (Stm32Uart *)opaque;
    uint64_t curr_time = qemu_get_clock_ns(vm_clock);

    assert(size > 0);

    /* Only handle the received character if the module is enabled, */
    if(s->USART_CR1_UE && s->USART_CR1_RE) {
        /* If there is already a character in the receive buffer, then
         * set the overflow flag.
         */
        if(s->USART_SR_RXNE) {
            s->USART_SR_ORE = 1;
            s->sr_read_since_ore_set = false;
            stm32_uart_update_irq(s);
        }

        /* Receive the character and mark the buffer as not empty. */
        s->USART_RDR = *buf;
        s->USART_SR_RXNE = 1;
        stm32_uart_update_irq(s);
    }

#ifdef STM32_UART_NO_BAUD_DELAY
    /* Do nothing - there is no delay before the module reports it can receive
     * the next character. */
    curr_time = curr_time; //Avoid "variable unused" compiler error
#else
    /* Indicate the module is receiving and start the delay. */
    s->receiving = true;
    qemu_mod_timer(s->rx_timer,  curr_time + s->ns_per_char);
#endif
}




/* REGISTER IMPLEMENTATION */

static uint32_t stm32_uart_USART_SR_read(Stm32Uart *s)
{
    /* If the Overflow flag is set, reading the SR register is the first step
     * to resetting the flag.
     */
    if(s->USART_SR_ORE) {
        s->sr_read_since_ore_set = true;
    }

    return (s->USART_SR_TXE << USART_SR_TXE_BIT) |
           (s->USART_SR_TC << USART_SR_TC_BIT) |
           (s->USART_SR_RXNE << USART_SR_RXNE_BIT) |
           (s->USART_SR_ORE << USART_SR_ORE_BIT);
}





static void stm32_uart_USART_SR_write(Stm32Uart *s, uint32_t new_value)
{
    uint32_t new_TC, new_RXNE;

