dna001/qemu/hw/stm32f2xx_uart.c
    new_TC = GET_BIT_VALUE(new_value, USART_SR_TC_BIT);
    /* The Transmit Complete flag can be cleared, but not set. */
    if(new_TC) {
        hw_error("Software attempted to set USART TC bit\n");
    }
    s->USART_SR_TC = new_TC;

    new_RXNE = GET_BIT_VALUE(new_value, USART_SR_RXNE_BIT);
    /* The Read Data Register Not Empty flag can be cleared, but not set. */
    if(new_RXNE) {
        hw_error("Software attempted to set USART RXNE bit\n");
    }
    s->USART_SR_RXNE = new_RXNE;

    stm32_uart_update_irq(s);
}


static void stm32_uart_USART_DR_read(Stm32Uart *s, uint32_t *read_value)
{
    /* If the Overflow flag is set, then it should be cleared if the software
     * performs an SR read followed by a DR read.
     */
    if(s->USART_SR_ORE) {
        if(s->sr_read_since_ore_set) {
            s->USART_SR_ORE = 0;

        }
    }

    if(!s->USART_CR1_UE) {
        hw_error("Attempted to read from USART_DR while UART was disabled.");
    }

    if(!s->USART_CR1_RE) {
        hw_error("Attempted to read from USART_DR while UART receiver "
                 "was disabled.");
    }

    if(s->USART_SR_RXNE) {
        /* If the receive buffer is not empty, return the value. and mark the
         * buffer as empty.
         */
        (*read_value) = s->USART_RDR;
        s->USART_SR_RXNE = 0;
    } else {
        hw_error("Read value from USART_DR while it was empty.");
    }

    stm32_uart_update_irq(s);
}


static void stm32_uart_USART_DR_write(Stm32Uart *s, uint32_t new_value)
{
    uint32_t write_value = new_value & 0x000001ff;

    if(!s->USART_CR1_UE) {
        hw_error("Attempted to write to USART_DR while UART was disabled.");
    }

    if(!s->USART_CR1_TE) {
        hw_error("Attempted to write to USART_DR while UART transmitter "
                 "was disabled.");
    }

    stm32_uart_check_tx_pin(s);

    if(s->USART_SR_TC) {
        /* If the Transmission Complete bit is set, it means the USART is not
         * currently transmitting.  This means, a transmission can immediately
         * start.
         */
        stm32_uart_start_tx(s, write_value);
    } else {
        /* Otherwise check to see if the buffer is empty.
         * If it is, then store the new character there and mark it as not empty.
         * If it is not empty, trigger a hardware error.  Software should check
         * to make sure it is empty before writing to the Data Register.
         */
        if(s->USART_SR_TXE) {
            s->USART_TDR = write_value;
            s->USART_SR_TXE = 0;
        } else {
            hw_error("Wrote new value to USART_DR while it was non-empty.");
        }
    }

    stm32_uart_update_irq(s);
}

/* Update the Baud Rate Register. */
static void stm32_uart_USART_BRR_write(Stm32Uart *s, uint32_t new_value,
                                        bool init)
{
    s->USART_BRR = new_value & 0x0000ffff;

    stm32_uart_baud_update(s);
}

static void stm32_uart_USART_CR1_write(Stm32Uart *s, uint32_t new_value,
                                        bool init)
{
    s->USART_CR1_UE = GET_BIT_VALUE(new_value, USART_CR1_UE_BIT);
    if(s->USART_CR1_UE) {
        /* Check to make sure the correct mapping is selected when enabling the
         * USART.
         */
        if(s->afio_board_map != stm32f2xx_afio_get_periph_map(s->stm32_afio, s->periph)) {
            hw_error("Bad AFIO mapping for %s", stm32f2xx_periph_name(s->periph));
        }
    }

    s->USART_CR1_TXEIE = GET_BIT_VALUE(new_value, USART_CR1_TXEIE_BIT);
    s->USART_CR1_TCIE = GET_BIT_VALUE(new_value, USART_CR1_TCIE_BIT);
    s->USART_CR1_RXNEIE = GET_BIT_VALUE(new_value, USART_CR1_RXNEIE_BIT);

    s->USART_CR1_TE = GET_BIT_VALUE(new_value, USART_CR1_TE_BIT);
    s->USART_CR1_RE = GET_BIT_VALUE(new_value, USART_CR1_RE_BIT);

    s->USART_CR1 = new_value & 0x00003fff;

    stm32_uart_update_irq(s);
}

static void stm32_uart_USART_CR2_write(Stm32Uart *s, uint32_t new_value,
                                        bool init)
{
    s->USART_CR2 = new_value & 0x00007f7f;
}

static void stm32_uart_USART_CR3_write(Stm32Uart *s, uint32_t new_value,
                                        bool init)
{
    s->USART_CR3 = new_value & 0x000007ff;
}

static void stm32_uart_reset(DeviceState *dev)
{
    Stm32Uart *s = FROM_SYSBUS(Stm32Uart, sysbus_from_qdev(dev));

    /* Initialize the status registers.  These are mostly
     * read-only, so we do not call the "write" routine
     * like normal.
     */
    s->USART_SR_TXE = 1;
    s->USART_SR_TC = 1;
    s->USART_SR_RXNE = 0;
    s->USART_SR_ORE = 0;

    // Do not initialize USART_DR - it is documented as undefined at reset
    // and does not behave like normal registers.
    stm32_uart_USART_BRR_write(s, 0x00000000, true);
    stm32_uart_USART_CR1_write(s, 0x00000000, true);
    stm32_uart_USART_CR2_write(s, 0x00000000, true);
    stm32_uart_USART_CR3_write(s, 0x00000000, true);

    stm32_uart_update_irq(s);
}


static uint64_t stm32_uart_readw(Stm32Uart *s, target_phys_addr_t offset)
{
    uint32_t value;

    switch (offset) {
        case USART_SR_OFFSET:
            return stm32_uart_USART_SR_read(s);
        case USART_DR_OFFSET:
            stm32_uart_USART_DR_read(s, &value);
            return value;
        case USART_BRR_OFFSET:
            return s->USART_BRR;
        case USART_CR1_OFFSET:
            return s->USART_CR1;
        case USART_CR2_OFFSET:
            return s->USART_CR2;
        case USART_CR3_OFFSET:
            return s->USART_CR3;
        case USART_GTPR_OFFSET:
            STM32_NOT_IMPL_REG(offset, 4);
            return 0;
        default:
            STM32_BAD_REG(offset, 4);
            return 0;
    }
}

static void stm32_uart_writew(
        Stm32Uart *s,
        target_phys_addr_t offset,
        uint64_t value)
{
    switch (offset) {
        case USART_SR_OFFSET:
            stm32_uart_USART_SR_write(s, value);
            break;
        case USART_DR_OFFSET:
            stm32_uart_USART_DR_write(s, value);
            break;
        case USART_BRR_OFFSET:
            stm32_uart_USART_BRR_write(s, value, false);
            break;
        case USART_CR1_OFFSET:
            stm32_uart_USART_CR1_write(s, value, false);
            break;
        case USART_CR2_OFFSET:
            stm32_uart_USART_CR2_write(s, value, false);
            break;
        case USART_CR3_OFFSET:
            stm32_uart_USART_CR3_write(s, value, false);
            break;
        case USART_GTPR_OFFSET:
            STM32_NOT_IMPL_REG(offset, 4);
            break;
        default:
            STM32_BAD_REG(offset, 4);
            break;
    }
}


