dna001/qemu/hw/stm32f2xx_uart.c
static uint64_t stm32_uart_readh(Stm32Uart *s, target_phys_addr_t offset)
{
    uint32_t value;

    switch (offset) {
        case USART_SR_OFFSET:
            return STM32_REG_READH_VALUE(offset, stm32_uart_USART_SR_read(s));
        case USART_DR_OFFSET:
            stm32_uart_USART_DR_read(s, &value);
            return STM32_REG_READH_VALUE(offset, value);
        case USART_BRR_OFFSET:
            return STM32_REG_READH_VALUE(offset, s->USART_BRR);
        case USART_CR1_OFFSET:
            return STM32_REG_READH_VALUE(offset, s->USART_CR1);
        case USART_CR2_OFFSET:
            return STM32_REG_READH_VALUE(offset, s->USART_CR2);
        case USART_CR3_OFFSET:
            return STM32_REG_READH_VALUE(offset, s->USART_CR3);
        case USART_GTPR_OFFSET:
            STM32_NOT_IMPL_REG(offset, 2);
            return 0;
        default:
            STM32_BAD_REG(offset, 2);
            return 0;
    }
}

static void stm32_uart_writeh(
        Stm32Uart *s,
        target_phys_addr_t offset,
        uint64_t value)
{
    switch (offset) {
        case USART_SR_OFFSET:
            /* The SR register only has bits in the first halfword, so no need to do
             * anything special.
             */
            stm32_uart_USART_SR_write(s, value);
            break;
        case USART_DR_OFFSET:
            stm32_uart_USART_DR_write(s,
                    STM32_REG_WRITEH_VALUE(offset, 0, value));
            break;
        case USART_BRR_OFFSET:
            stm32_uart_USART_BRR_write(s,
                    STM32_REG_WRITEH_VALUE(offset, s->USART_BRR, value), false);
            break;
        case USART_CR1_OFFSET:
            stm32_uart_USART_CR1_write(s,
                    STM32_REG_WRITEH_VALUE(offset, s->USART_CR1, value), false);
            break;
        case USART_CR2_OFFSET:
            stm32_uart_USART_CR2_write(s,
                    STM32_REG_WRITEH_VALUE(offset, s->USART_CR2, value), false);
            break;
        case USART_CR3_OFFSET:
            stm32_uart_USART_CR3_write(s,
                    STM32_REG_WRITEH_VALUE(offset, s->USART_CR3, value), false);
            break;
        case USART_GTPR_OFFSET:
            STM32_NOT_IMPL_REG(offset, 2);
            break;
        default:
            STM32_BAD_REG(offset, 2);
            break;
    }
}

static uint64_t stm32_uart_read(void *opaque, target_phys_addr_t offset,
                          unsigned size)
{
    Stm32Uart *s = (Stm32Uart *)opaque;

    switch(size) {
        case HALFWORD_ACCESS_SIZE:
            return stm32_uart_readh(s, offset);
        case WORD_ACCESS_SIZE:
            return stm32_uart_readw(s, offset);
        default:
            STM32_BAD_REG(offset, size);
            return 0;
    }
}

static void stm32_uart_write(void *opaque, target_phys_addr_t offset,
                       uint64_t value, unsigned size)
{
    Stm32Uart *s = (Stm32Uart *)opaque;

    stm32f2xx_rcc_check_periph_clk((Stm32Rcc *)s->stm32_rcc, s->periph);

    switch(size) {
        case HALFWORD_ACCESS_SIZE:
            stm32_uart_writeh(s, offset, value);
            break;
        case WORD_ACCESS_SIZE:
            stm32_uart_writew(s, offset, value);
            break;
        default:
            STM32_BAD_REG(offset, size);
            break;
    }
}

static const MemoryRegionOps stm32_uart_ops = {
    .read = stm32_uart_read,
    .write = stm32_uart_write,
    .endianness = DEVICE_NATIVE_ENDIAN
};





/* PUBLIC FUNCTIONS */

void stm32f2xx_uart_connect(Stm32Uart *s, CharDriverState *chr,
                        uint32_t afio_board_map)
{
    s->chr = chr;
    if (chr) {
        qemu_chr_add_handlers(
                s->chr,
                stm32_uart_can_receive,
                stm32_uart_receive,
                stm32_uart_event,
                (void *)s);
    }

    s->afio_board_map = afio_board_map;
}




/* DEVICE INITIALIZATION */

static int stm32_uart_init(SysBusDevice *dev)
{
    qemu_irq *clk_irq;
    Stm32Uart *s = FROM_SYSBUS(Stm32Uart, dev);

    s->stm32_rcc = (Stm32Rcc *)s->stm32_rcc_prop;
    s->stm32_gpio = (Stm32Gpio **)s->stm32_gpio_prop;
    s->stm32_afio = (Stm32Afio *)s->stm32_afio_prop;

    memory_region_init_io(&s->iomem, &stm32_uart_ops, s,
                          "uart", 0x03ff);
    sysbus_init_mmio(dev, &s->iomem);

    sysbus_init_irq(dev, &s->irq);

    s->rx_timer =
          qemu_new_timer_ns(vm_clock,(QEMUTimerCB *)stm32_uart_rx_timer_expire, s);
    s->tx_timer =
          qemu_new_timer_ns(vm_clock,(QEMUTimerCB *)stm32_uart_tx_timer_expire, s);

    /* Register handlers to handle updates to the USART's peripheral clock. */
    clk_irq =
          qemu_allocate_irqs(stm32_uart_clk_irq_handler, (void *)s, 1);
    stm32f2xx_rcc_set_periph_clk_irq(s->stm32_rcc, s->periph, clk_irq[0]);

    stm32_uart_reset((DeviceState *)s);

    return 0;
}

static Property stm32_uart_properties[] = {
    DEFINE_PROP_PERIPH_T("periph", Stm32Uart, periph, STM32_PERIPH_UNDEFINED),
    DEFINE_PROP_PTR("stm32f2xx_rcc", Stm32Uart, stm32_rcc_prop),
    DEFINE_PROP_PTR("stm32f2xx_gpio", Stm32Uart, stm32_gpio_prop),
    DEFINE_PROP_PTR("stm32f2xx_afio", Stm32Uart, stm32_afio_prop),
    DEFINE_PROP_END_OF_LIST()
};

static void stm32_uart_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    SysBusDeviceClass *k = SYS_BUS_DEVICE_CLASS(klass);

    k->init = stm32_uart_init;
    dc->reset = stm32_uart_reset;
    dc->props = stm32_uart_properties;
}

static TypeInfo stm32_uart_info = {
    .name  = "stm32f2xx_uart",
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size  = sizeof(Stm32Uart),
    .class_init = stm32_uart_class_init
};

static void stm32_uart_register_types(void)
{
    type_register_static(&stm32_uart_info);
}

type_init(stm32_uart_register_types)
